cfe llm/InformationRegisters/AI_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_Диалоги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификатоБеседыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РольСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБеседы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_РольСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РольСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>system</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>user</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>tool</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/InformationRegisters/AI_Диалоги/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция НачатьДиалог() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторБеседы = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ИдентификаторСообщения = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ИдентификатоБеседыСтрокой = Строка(МенеджерЗаписи.ИдентификаторБеседы);
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Сообщение= "Начало диалога.";
	МенеджерЗаписи.Записать(Ложь);
	
	Возврат МенеджерЗаписи.ИдентификаторБеседы;
	
КонецФункции

Процедура ЗаписьСобытия(ИдентификаторБеседы, Роль, Сообщение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторБеседы = ИдентификаторБеседы;
	МенеджерЗаписи.ИдентификатоБеседыСтрокой = Строка(МенеджерЗаписи.ИдентификаторБеседы);
	МенеджерЗаписи.ИдентификаторСообщения = Новый УникальныйИдентификатор;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Сообщение = Сообщение;
	МенеджерЗаписи.Роль = ?(ТипЗнч(Роль) = Тип("Строка"), Перечисления.AI_РольСообщения[Роль], Роль);
	МенеджерЗаписи.Записать(Ложь);
	
КонецПроцедуры

Функция ПолучитьСообщенияДиалога(ИдентификаторБеседы, КоличествоСообщений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		СтрЗаменить("ВЫБРАТЬ ПЕРВЫЕ 789159
		            |	AI_Диалоги.Период КАК Период,
		            |	AI_Диалоги.Роль КАК Роль,
		            |	AI_Диалоги.Сообщение КАК Сообщение
		            |ИЗ
		            |	РегистрСведений.AI_Диалоги КАК AI_Диалоги
		            |ГДЕ
		            |	AI_Диалоги.ИдентификаторБеседы = &ИдентификаторБеседы
		            |	И AI_Диалоги.Роль В (ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.user), ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.assistant))
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	AI_Диалоги.Период УБЫВ", "789159", КоличествоСообщений);
	
	Запрос.УстановитьПараметр("ИдентификаторБеседы", ИдентификаторБеседы);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ПеревернутыйМассив = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		СтруктураЗначения = Новый Структура("Период, Роль, Сообщение", Результат.Период, нрег(Результат.Роль), Результат.Сообщение);
		ПеревернутыйМассив.Добавить(СтруктураЗначения);
	КонецЦикла;
	
	// Перевернем массив что бы добиться правильной историчности
	ИтоговыйМассив = Новый Массив;

	Индекс = ПеревернутыйМассив.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ИтоговыйМассив.Добавить(ПеревернутыйМассив.Получить(Индекс));
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат ИтоговыйМассив;
	
КонецФункции

#КонецОбласти
